app/controllers/cart_items_controller.rb

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "cart_items".* FROM "cart_items"
---
	def index
		@book = Book.find(params[:book_id])
		@cart_items = CartItem.all

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "cart_items" ("quantity", "created_at", "updated_at", "title", "body") VALUES (?, ?, ?, ?, ?)  [["quantity", 3], ["created_at", "2020-04-14 12:19:16.088463"], ["updated_at", "2020-04-14 12:19:16.088463"], ["title", "a"], ["body", "s"]]
---
	def create
		@book = Book.find(params[:book_id])
		@cart_item = CartItem.new
		@cart_item.title = @book.title
		@cart_item.body = @book.body
		@cart_item.quantity = params[:quantity]
		@cart_item.save

DELETE FROM "cart_items" WHERE "cart_items"."id" = ?  [["id", 25]]
---
	def destroy
		@cart_item = CartItem.find(params[:id])
		@cart_item.destroy

DELETE FROM "cart_items" WHERE "cart_items"."id" = ?  [["id", 37]]
---
	def destroy_all
		CartItem.destroy_all

SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."id" = ? LIMIT ?  [["id", 52], ["LIMIT", 1]]
UPDATE "cart_items" SET "quantity" = ?, "updated_at" = ? WHERE "cart_items"."id" = ?  [["quantity", 2], ["updated_at", "2020-04-15 09:25:25.383016"], ["id", 55]]
---
	def update
		@cart_item = CartItem.find(params[:id])
		@cart_item.update(cart_item_params)